{
  "Star-Wars": [
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star1.png?raw=true",
      "category": "Star-Wars",
      "name": "Caneca 3D Stormtrooper Ceramica Star Wars",
      "price": "60,00",
      "description": "Caneca 3D Capacete Stormtrooper Star Wars Produto Oficial  Linda caneca de ceramica no formato do divertido Stormtrooper para voce dar de presente ou presentear a si mesmo. Agora voce pode ter uma caneca totalmente diferente para decorar seu ambiente, com espessura otima para garantir resistencia e conforto para tomar sua bebida preferida!   Produto oficial e licenciado Star Wars.  Medidas aproximadas  Altura: 11cm Comprimento: 17 cm Largura: 17 cm Diametro: 11 cm  Capacidade: 500ml Material: Ceramica Peso: 450g",
      "id": 1
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star2.png?raw=true",
      "category": "Star-Wars",
      "name": "Fantasia masculina Star Wars Kylo Ren",
      "price": "120,00",
      "description": "Material da fantasia: poliéster (túnica externa + cachecol) + tecido Oxford (túnica interna) + poliuretano (cinto + luvas) Material: PVC, não gosta de plástico barato, mais durável e não tem cheiro de plástico.",
      "id": 2
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star3.png?raw=true",
      "category": "Star-Wars",
      "name": "Produto XYZ",
      "price": "60,00",
      "description": "Sem descrição",
      "id": 3
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star4.png?raw=true",
      "category": "Star-Wars",
      "name": "Lego Star Wars ",
      "price": "700,00",
      "description": "Coleção: Lego Material do brinquedo: Plástico Idade mínima recomendada: 18 anos É magnético: Não",
      "id": 4
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star5.png?raw=true",
      "category": "Star-Wars",
      "name": "Wallpaper Yoda",
      "price": "10,00",
      "description": "Sem descrição",
      "id": 5
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/star6.png?raw=true",
      "category": "Star-Wars",
      "name": "Boneco Yoda Baby Star Wars Para Decoração",
      "price": "100,00",
      "description": "Nome do produto: Yoda baby boneca Material do produto: PVC/latex/pano Especificação: 28*20*15CM (medição normal terá erros)",
      "id": 6
    }
  ],
  "Console": [
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles1.png?raw=true",
      "category": "Console",
      "name": "Gameboy Classic Transparente",
      "price": "700,00",
      "description": "É um console portátil desenvolvido pela Nintendo, lançado em 21 de abril de 1989 no Japão, em 31 de julho de 1989 na América do Norte e em 28 de setembro de 1990 na Europa, é o primeiro console da linha Game Boy, foi criado por Gunpei Yokoi e pela Nintendo Research & Development 1, versões redesenhadas do console foram lançadas em 1996 e em 1998, o Game Boy Pocket e o Game Boy Light (somente para o Japão) ",
      "id": 1
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles2.png?raw=true",
      "category": "Console",
      "name": "Console Xbox Series X Microsoft com 1TB SSD",
      "price": "1.400,00",
      "description": "É um console portátil desenvolvido pela Nintendo, lançado em 21 de abril de 1989 no Japão, em 31 de julho de 1989 na América do Norte e em 28 de setembro de 1990 na Europa, é o primeiro console da linha Game Boy, foi criado por Gunpei Yokoi e pela Nintendo Research & Development 1, versões redesenhadas do console foram lançadas em 1996 e em 1998, o Game Boy Pocket e o Game Boy Light (somente para o Japão) ",
      "id": 2
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles3.png?raw=true",
      "category": "Console",
      "name": "Controle Joy Con Nintendo Switch Par Azul/Vermelho - Nintendo",
      "price": "165,50",
      "description": "【Design para Switch】Este controlador sem fio de terceiros para a esquerda e direita é compatível com o console Switch como substituição para controles Joy-pad. Ring Fit Adventure não é suportado agora. Controles esquerdo e direito não são compatíveis com a aderência original. 【Função de emparelhamento rápido e despertar】Forte capacidade anti-interferência, manuseio fácil e sinal de conexão estável. Quando o interruptor estiver no modo de suspensão, você deve acordar o seu interruptor com o botão Home por muito tempo, o interruptor de tela acenderá. 【 Baterias de 400 mAh 】 Bateria de lítio embutida de 400 mAh, o tempo de reprodução pode durar até 10 horas, o tempo total de carregamento é de 2 a 3 horas. 【Design ergonômico】 O design simplificado ajuda a descansar suas palmas e dedos indicadores; peso semelhante ao controle original; parece uma pegada confortável ergonômica quando anexada ao console. 【Alto desempenho e inclui alças】Os controles esquerdo e direito podem ser usados como um controle inteiro ou podem ser usados como dois controles independentes para o Switch. O bastão 3D Neotérico pode ser operado precisamente em 360° em toda a volta. Oferecendo a você uma experiência de jogo agradável. Sem NFC para suportar a função Amiibo e função de câmera de movimento infravermelho.",
      "id": 3
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles4.png?raw=true",
      "category": "Console",
      "name": "Console Nintendo Entertainment System Nes-001",
      "price": "449,90",
      "description": "Entertainment System, Sistema de Entretenimento Nintendo ou simplesmente NES foi o videogame de maior sucesso comercial na sua época, ajudou a indústria de videogames a se recuperar da crise de 1983 e estabeleceu novos padrões que seriam seguidos pela indústria. Também foi o primeiro console a ser produzido por terceiros, o que ajudou a divulgar o sistema em todo o mundo. O NES também foi um dos primeiros consoles a se apoiar em jogos feitos por terceiros (não só pela própria fabricante). Seu código de modelo é NES-001. O NES encontra-se em 12º lugar na lista de consoles mais vendidos de sempre.  O NES foi lançado oficialmente nos EUA no dia 18 de Outubro de 1985 apenas em Nova York, para teste de aceitação do público. Foram disponibilizadas inicialmente 50.000 unidades que se esgotaram rapidamente, o que levou a Nintendo a lançar o console no resto do país em Fevereiro do ano seguinte. Mais tarde o console foi lançado oficialmente na Europa, Austrália e Brasil. O sistema, apesar da concorrência com o Sega Master System, manteve-se na liderança dos mercados japonês e americano durante uma década.  Nos anos 90 devido a renovação tecnológica o sistema foi substituído por consoles mais modernos. A Nintendo norte-americana continuou dando suporte ao console até 1995 quando sua produção foi encerrada. No oriente, a Nintendo japonesa produziu uma nova versão do Famicom (chamada de Famicom AV) e manteve seu suporte de assistência técnica até outubro de 2003, quando oficialmente descontinuou o sistema por não haver mais peças de reposição. Isso deu ao sistema um tempo oficial de vida de 20 anos, o maior entre todos os consoles lançados até hoje.  Empresa: Nintendo Entertainment System;  Ano: 1985.",
      "id": 4
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles5.png?raw=true",
      "category": "Console",
      "name": "Console Playstation 5 825GB SSD + Controle Sony DualSense",
      "price": "3.799,00",
      "description": "Jogar Não Tem Limites  Desfrute do carregamento extremamente rápido com o SSD de altíssima velocidade, uma imersão mais profunda com suporte a feedback tátil, gatilhos adaptáveis e áudio 3D, além de uma geração inédita de jogos incríveis para Playstation.    Domine o poder de uma CPU e GPU personalizadas e o SSD com E/S integradas que redefinem as regras do que o console Playstation pode fazer.  Maximize suas sessões de jogo com tempos de carregamento praticamente instantâneos para jogos do PS5 instalados. A integração personalizada dos sistemas de console PS5 permite que os criadores extraiam dados do SSD tão rápido que eles podem desenvolver jogos de formas que antes seriam impossíveis.    O Controle Sem Fio DualSense para PS5 oferece feedback tátil imersivo, gatilhos dinâmicos e adaptáveis e um microfone integrado, tudo isso em um design icônico. Desfrute de feedback tátil com o Controle Sem Fio DualSense em jogos específicos do PS5 e sinta o impacto de suas ações no jogo graças ao feedback sensorial dinâmico. Assuma o controle com os gatilhos adaptáveis e imersivos, agora com níveis dinâmicos de resistência que simulam o impacto físico das atividades em jogos específicos do PS5.",
      "id": 5
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/consoles6.png?raw=true",
      "category": "Console",
      "name": "Controller Modelo 1708 | Extremerate Soft Touch Grip White Front Housing Shell Faceplate Para Microsoft Xbox One X & One S",
      "price": "176,00",
      "description": "Extremerate Sabemos Que A Caixa Do Seu Controlador É Mais Do Que Apenas Um Acessório De Plástico. É Seu Parceiro, Seu Parceiro De Batalha. É Por Isso Que Usamos Apenas As Melhores Peças E As Tintas Mais Vibrantes Para Garantir Que Nossos Drivers Sejam Da Mais Alta Qualidade. Acredite Em Mim, Seu Amigo Vai Admirá-lo Depois De Instalar Este Escudo Frontal Exclusivo. Características Do Produto: ﻿ Feito De Plástico Abs Não Tóxico E Durável. Sem Odores. Ele Se Encaixa Completamente Nivelado Em Todos Os Lados. Sente-se Adequadamente Em Todos Os Clipes. Personalize Seu Xbox One S Ou Xbox One X. É Uma Bela Mudança De Um Preto Normal Sem Gastar Muito Dinheiro.",
      "id": 6
    }
  ],
  "Diversos": [
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos1.png?raw=true",
      "category": "Diversos",
      "name": "Fantasia Pikachu cosplay",
      "price": "200,00",
      "description": "Sem descrição",
      "id": 1
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos2.png?raw=true",
      "category": "Diversos",
      "name": "Playstation Vr",
      "price": "4500,00",
      "description": "O pacote inclui fone de ouvido PlayStation VR, câmera PlayStation, 2 controladores de movimento PlayStation, disco de ferro VR da Marvel e disco de demonstração 3.0. Usando dois controles de movimento PlayStation Move, acenda os jatos repulsores do Homem de ferro e sopre no céu com um arsenal de emblemático equipamento de ferro na ponta dos seus dedos. Enfrente um dos maiores inimigos do Homem de Ferro em altas estacas, batalhas repletas de ação.",
      "id": 2
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos3.png?raw=true",
      "category": "Diversos",
      "name": "Relógio de mesa retrô",
      "price": "50,00",
      "description": "Sem descrição",
      "id": 3
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos4.png?raw=true",
      "category": "Diversos",
      "name": "Game Sonic the Hedgehog 2",
      "price": "50,00",
      "description": "Na página inicial do Steam, vá em 'Busca na loja' e procure por 'Sonic'; O título deve ser o segundo exibido. Clique nele; Assim que carregar, desça a página e clique sobre a opção 'Adicionar à conta'. Pronto. O jogo é seu e pode ser baixado agora ou em outra oportunidade.",
      "id": 4
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos5.png?raw=true",
      "category": "Diversos",
      "name": "Camiseta Slim Nerderia e Lojaria controle nintendo cinza",
      "price": "30,00",
      "description": "Tecido em malha importada dry fir air, micro furos para eliminação do suor e maior transpiração, deixando a camiseta leve e mais seca. Brilho e toque acetinado. Não é necessário passar com ferro após lavagem devido a composição das fibras, basta retirar do varal e vestir. Processo de termo fusão que garante mais durabilidade e flexibilidade na estampa, imagem não desgasta e não danifica. . A costura dupla auxilia na qualidade da mesma.. Conta ainda com características elástica que não deforma. Retém menos suor.",
      "id": 5
    },
    {
      "img": "https://github.com/MaiconNunes315/AluraGeek/blob/main/src/images/diversos6.png?raw=true",
      "category": "Diversos",
      "name": "Camiseta anime",
      "price": "30,00",
      "description": "Sem descrição",
      "id": 6
    }
  ],
  "categories": [
    "Star Wars",
    "Console",
    "Diversos"
  ]
}
